<h1>Accessing Specific Value in a DataSeries Using Pandas</h1>

In [1]:
import pandas as pd

<h1>Using LOC and iLOC properties with a DataSeries</h1>

In [2]:
colours = pd.Series (['red','purple','blue','green','yellow'],
                    index = [1,2,3,5,8])
colours

1       red
2    purple
3      blue
5     green
8    yellow
dtype: object

In [3]:
colours[1]

'red'

In [4]:
colours.loc[1]  # Refers to label index

'red'

In [5]:
colours.iloc[1] # Refers to positional index

'purple'

In [6]:
colours.loc[3:8] # NOTE: LOC is upper bound inclusive

3      blue
5     green
8    yellow
dtype: object

In [7]:
colours.iloc[1:3] # NOTE: iLOC is upper bound exclusive

2    purple
3      blue
dtype: object

In [8]:
city_revenues = pd.Series([4200, 
                           8000, 
                           6500],
                          index = ['Amsterdam', 
                                   'Toronto', 
                                   'Tokyo'])  # Manually assign index to each IDENTIFIER
city_revenues

# Use a dictionary as a data series -> same exact result as data series with explicitly stated indexing vs data series with dictionary
city_employee_count = {'Amsterdam': 5,
                      'Tokyo': 8}

employee_count = pd.Series(city_employee_count)
employee_count

city_data = pd.DataFrame(
    {'revenue': city_revenues,
    'employee count': employee_count}  # Key of Dictionary = Column, Index of Value = Row, Value of value = Cell
)
city_data  # Automatically reference the same index

           revenue  employee count
Amsterdam     4200             5.0
Tokyo         6500             8.0
Toronto       8000             NaN

In [9]:
# Use LOC with DataFrame instead of DataSeries
city_data.loc['Toronto']

revenue           8000.0
employee count       NaN
Name: Toronto, dtype: float64

In [10]:
# Using LOC with individual DS
city_data.loc['Amsterdam':'Tokyo', 'revenue']  # Acting on revenue DS

Amsterdam    4200
Tokyo        6500
Name: revenue, dtype: int64

<h3>Grouping and Aggregating Data</h3>

In [11]:
# At-a-glance statistical analysis
city_data.describe()

           revenue  employee count
count     3.000000         2.00000
mean   6233.333333         6.50000
std    1913.983629         2.12132
min    4200.000000         5.00000
25%    5350.000000         5.75000
50%    6500.000000         6.50000
75%    7250.000000         7.25000
max    8000.000000         8.00000

In [12]:
# All math module stuff comes with Pandas
city_revenues.sum()

18700

In [13]:
city_revenues.max()

8000

In [14]:
city_revenues.mean()

6233.333333333333

<h1>Combining Multiple DataFrames</h1>

In [15]:
city_data # OG DataFrame

           revenue  employee count
Amsterdam     4200             5.0
Tokyo         6500             8.0
Toronto       8000             NaN

In [16]:
further_city_data = pd.DataFrame({'revenue': [700, 3400,],
                                 'employee count':[2,2]},
                                index = ['New York','Barcelona'])
further_city_data

           revenue  employee count
New York       700               2
Barcelona     3400               2

In [17]:
all_city_data = pd.concat([city_data, further_city_data], sort = False)
all_city_data

           revenue  employee count
Amsterdam     4200             5.0
Tokyo         6500             8.0
Toronto       8000             NaN
New York       700             2.0
Barcelona     3400             2.0

In [18]:
# Adding items to the DataFrame - columns
city_countries = pd.DataFrame({'country':['Holland','Japan','Canada','Spain'],
                              'capital':['Amsterdam','Tokyo','Ottawa','Madrid']},
                             index = ['Amsterdam','Tokyo','Toronto','Barcelona'])

city_countries

           country    capital
Amsterdam  Holland  Amsterdam
Tokyo        Japan      Tokyo
Toronto     Canada     Ottawa
Barcelona    Spain     Madrid

In [19]:
cities = pd.concat([all_city_data, city_countries], axis = 1, sort = False)  # Specify axis to add as data series
cities

           revenue  employee count  country    capital
Amsterdam     4200             5.0  Holland  Amsterdam
Tokyo         6500             8.0    Japan      Tokyo
Toronto       8000             NaN   Canada     Ottawa
New York       700             2.0      NaN        NaN
Barcelona     3400             2.0    Spain     Madrid

<h3>Using Merge in Pandas</h3>

In [21]:
countries = pd.DataFrame(
    {'population_million':[17,127,37],
     'continent':['Europe','Asia','North America']},

    index = ['Holland','Japan','Canada'])
countries

         population_million      continent
Holland                  17         Europe
Japan                   127           Asia
Canada                   37  North America

In [ ]:
cities

In [23]:
pd.merge(cities, countries, left_on = 'country', right_index = True)  # Use left on because cities is first parameter, Identify right index as countries

# Use when wanting the indices of one dataframe to "filter" another dataframe based on if its data series contains the first dataframe's indices

# left_on keyword specifies the column to 'merge on' (using left DF)
# right_index means DataFrame on right side (countries) will be joined on the index
# Only items with common column 'country' are added to merged to new DF

,revenue,employee count,country,capital,population_million,continent
Amsterdam,4200,5.0,Holland,Amsterdam,17,Europe
Tokyo,6500,8.0,Japan,Tokyo,127,Asia
Toronto,8000,NaN,Canada,Ottawa,37,North America